spec/dummy/app/controllers/dummy/order_items_controller.rb

  def destroy
    order_item = OrderItem.find(params[:id])

    if order_item.destroy
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 7]]